app/controllers/days_controller.rb

  def create
    @day = Day.new(params[:day])
    respond_to do |format|
      if @day.save
---
INSERT INTO "days" ("lesson_plan_file_size", "created_at", "title", "lesson_plan_file_name", "unit_id", "updated_at", "lesson_plan_content_type", "description", "lesson_plan_updated_at") VALUES(NULL, '2010-03-28 02:08:26', 'first day!', NULL, 1, '2010-03-28 02:08:26', NULL, '', NULL)

  def index
    @days = Day.paginate(:page => params[:page], :per_page => DAYS_PER_PAGE)
---
SELECT * FROM "days" LIMIT 20 OFFSET 0

  def edit
    @unit = @day.unit
    @units = Unit.all
---
SELECT * FROM "units"

  def new
    @units = Unit.all
---
SELECT * FROM "units"

  def find_day
    @day = Day.find(params[:id]) if params[:id]
---
SELECT * FROM "days" WHERE ("days"."id" = 1)