app/controllers/units_controller.rb

INSERT INTO "units" ("created_at", "title", "updated_at", "subject", "description") VALUES('2010-03-28 01:50:04', 'first unit!', '2010-03-28 01:50:04', '', '')
---
  def create
    @units = Unit.all
    @unit = Unit.new(params[:unit])
    respond_to do |format|
      if @unit.save

SELECT * FROM "units" LIMIT 20 OFFSET 0
---
  def index
    @units = Unit.paginate(:page => params[:page], :per_page => UNITS_PER_PAGE)

SELECT * FROM "units" WHERE ("units"."id" = 1)
---
  def find_unit
    @unit = Unit.find(params[:id]) if params[:id]