app/controllers/uploads_controller.rb

  def create
    @upload = Upload.create(params[:upload])
---
INSERT INTO "uploads" ("created_at", "updated_at", "upload_file_name", "upload_file_size", "upload_content_type", "upload_updated_at") VALUES('2010-03-28 18:23:53', '2010-03-28 18:23:53', NULL, NULL, NULL, NULL)

  def destroy
    respond_to do |format|
      if @upload.destroy
---
DELETE FROM "uploads" WHERE "id" = 1

  def index
    @uploads = Upload.paginate(:page => params[:page], :per_page => UPLOADS_PER_PAGE)
---
SELECT * FROM "uploads" LIMIT 20 OFFSET 0

  def find_upload
    @upload = Upload.find(params[:id]) if params[:id]
---
SELECT * FROM "uploads" WHERE ("uploads"."id" = 1)